
const PrivacyPolicy = () => {
  return (
    <div className="min-h-screen py-20">
      <div className="container mx-auto px-4">
        <h1 className="heading-2 mb-8">Политика конфиденциальности</h1>
        
        <div className="prose prose-gray max-w-none">
          <p className="mb-6">Последнее обновление: {new Date().toLocaleDateString('ru-RU')}</p>
          
          <section className="mb-8">
            <h2 className="heading-3 mb-4">ВВЕДЕНИЕ</h2>
            <p className="mb-4">
              Настоящая Политика конфиденциальности персональных данных (далее - Политика) действует в отношении всей информации,
              которую ИП Данко Александр Юрьевич, ИНН 421718911238, адрес регистрации: г. Кемерово, пр. Молодежный19б, кв. 349,
              действующий на основании внесении записи в ЕГРИП № 320420500076682 (далее – Администрация сайта) может получить о Пользователе
              по время использования им сайта в сети Интернет по адресу: https://playbackrental.ru (далее – Сайт).
            </p>
            <p className="mb-4">
            Использование сайта https://playbackrental.ru  и форм обратной связи, размещенных на нём означает безоговорочное согласие Пользователя
            с настоящей Политикой и указанными в ней условиями обработки его персональной информации; в случае несогласия с этими условиями Пользователь
            должен воздержаться от использования Сайта.
            </p>
          </section>

          <section className="mb-8">
            <h2 className="heading-3 mb-4">1. ОБЩИЕ ПОЛОЖЕНИЯ</h2>
            <p className="mb-4"> 1.1. В рамках настоящей Политики под персональной информацией Пользователя понимаются: </p>
            <p className="mb-4"> 1.1.1. Персональная информация, которую Пользователь предоставляет о себе самостоятельно при заполнении формы обратной связи (отправка заявок, сообщений и т.д.), включая персональные данные Пользователя (имя, электронная почта, номер телефона). Обязательная для предоставления Сервисов информация помечена специальным образом. Иная информация предоставляется Пользователем на его усмотрение. </p>
            <p className="mb-4"> 1.1.2. Данные, которые автоматически передаются Сайту в процессе их использования с помощью установленного на устройстве Пользователя программного обеспечения, в том числе данные файлов cookie, IP-адрес, информация о браузере Пользователя (или иной программе, с помощью которой осуществляется доступ к сервисам), технические характеристики оборудования и программного обеспечения, используемых Пользователем, дата и время доступа к сервисам, адреса запрашиваемых страниц и иная подобная информация. </p>
            <p className="mb-4"> 1.2. Настоящая Политика конфиденциальности применяется только к Сайту. Сайт не контролирует и не несет ответственности за сайты третьих лиц, на которые Пользователь может перейти по ссылкам, доступным на Сайте. </p>
            <p className="mb-4"> 1.3. Сайт не проверяет достоверность персональной информации, предоставляемой Пользователем, не осуществляет контроль за его дееспособностью. Сайт исходит из того, что Пользователь дееспособен, предоставляет достоверную и достаточную персональную информацию. </p>
          </section>

          <section className="mb-8">
            <h2 className="heading-3 mb-4">2. ЦЕЛИ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЕЙ</h2>
            <p className="mb-4"> 2.1. Сайт собирает и хранит только ту персональную информацию, которая необходима для маркетинговой деятельности и оказания услуг Пользователю сайта</p>
            <p className="mb-4"> 2.2. Персональную информацию Пользователя Сайт обрабатывает в следующих целях: </p>
            <p className="mb-4"> 2.2.1. Идентификации Пользователя, для целей заключения, исполнения и прекращения гражданско-правовых договоров. </p>
            <p className="mb-4"> 2.2.2. Установления с Пользователем обратной связи, включая направление информации об оказываемых услугах, а также для осуществления иной маркетинговой деятельности Администрацией сайта. </p>
            <p className="mb-4"> 2.2.3. Подтверждения достоверности и полноты персональных данных, предоставленных Пользователем.</p>
            <p className="mb-4"> 2.2.4. Передача данных третьим лицам в целях осуществления деятельности Администрации сайта.</p>
          </section>

          <section className="mb-8">
            <h2 className="heading-3 mb-4">3. УСЛОВИЯ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЕЙ И ЕЕ ПЕРЕДАЧИ ТРЕТЬИМ ЛИЦАМ</h2>
            <p className="mb-4"> 3.1. Сайт хранит персональную информацию Пользователей в базе данных сайта, которая хранится на сервере хостинг-провайдера, размещенном на территории РФ.</p>
            <p className="mb-4"> 3.2. В отношении персональной информации Пользователя сохраняется её конфиденциальность, кроме случаев добровольного предоставления Пользователем информации о себе для общего доступа неограниченному кругу лиц. При использовании отдельных сервисов Пользователь соглашается с тем, что определенная часть его персональной информации становится общедоступной.</p>
            <p className="mb-4"> 3.3. Сайт вправе передать персональную информацию Пользователя третьим лицам в следующих случаях: </p>
            <p className="mb-4"> 3.3.1. Пользователь выразил согласие на такие действия.</p>
            <p className="mb-4"> 3.3.2. Передача необходима для исполнения договора с Пользователем.</p>
            <p className="mb-4"> 3.3.3. Передача предусмотрена российским или иным применимым законодательством в рамках установленной законодательством процедуры.</p>
            <p className="mb-4"> 3.4. Администрация Сайта принимает необходимые организационные и технические меры для защиты персональной информации Пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий третьих лиц, в том числе: установлено антивирусное программное обеспечение.</p>
          </section>

          <section className="mb-8">
            <h2 className="heading-3 mb-4">4. ПРАВА ПОЛЬЗОВАТЕЛЯ</h2>
            <p className="mb-4"> 4.1. Пользователь имеет право:</p>
            <p className="mb-4"> 4.1.1. отозвать согласие на обработку персональных данных, отправив соответствующее заявление на email PlaybackRental@yandex.ru</p>
          </section>

          <section className="mb-8">
            <h2 className="heading-3 mb-4">5. ОБЯЗАННОСТИ АДМИНИСТРАЦИИ САЙТА</h2>
            <p className="mb-4"> 5.1. Администрация Сайта обязана:</p>
            <p className="mb-4"> 5.1.1. Использовать полученную информацию исключительно для целей, указанных в настоящей Политике конфиденциальности.</p>
            <p className="mb-4"> 5.1.2. Обеспечить хранение конфиденциальной информации в тайне, не разглашать без предварительного письменного разрешения Пользователя, а также не осуществлять продажу, обмен, опубликование либо разглашение иными возможными способами переданных персональных данных Пользователя, за исключением предусмотренных настоящей Политикой конфиденциальности.</p>
            <p className="mb-4"> 5.1.3. Принимать меры предосторожности для защиты конфиденциальности персональных данных Пользователя согласно порядку, обычно используемому для защиты такого рода информации в существующем деловом обороте.</p>
            <p className="mb-4"> 5.1.4. Осуществить блокирование персональных данных, относящихся к соответствующему Пользователю, с момента обращения Пользователя или его законного представителя либо уполномоченного органа по защите прав субъектов персональных данных на период проверки в случае выявления недостоверных персональных данных или неправомерных действий.</p>
          </section>

          <section className="mb-8">
            <h2 className="heading-3 mb-4">6. ОТВЕТСТВЕННОСТЬ СТОРОН</h2>
            <p className="mb-4"> 6.1. Администрация Сайта, не исполнившая свои обязательства, несёт ответственность за убытки, понесенные Пользователем в связи с неправомерным использованием персональных данных, в соответствии с законодательством Российской Федерации.</p>
            <p className="mb-4"> 6.2. В случае утраты или разглашения конфиденциальной информации Администрация Сайта не несет ответственности, если данная конфиденциальная информация:</p>
            <p className="mb-4"> 6.2.1. Стала публичным достоянием до её утраты или разглашения.</p>
            <p className="mb-4"> 6.2.2. Была получена от третьей стороны до момента её получения Администрацией Сайта.</p>
            <p className="mb-4"> 6.2.3. Была разглашена с согласия Пользователя.</p>
          </section>

          <section className="mb-8">
            <h2 className="heading-3 mb-4">7. РАЗРЕШЕНИЕ СПОРОВ</h2>
            <p className="mb-4"> 7.1. До обращения в суд с иском по спорам, возникающим из отношений между Пользователем и Администрацией Сайта, обязательным является предъявление претензии.</p>
            <p className="mb-4"> 7.2. Получатель претензии в течение тридцати календарных дней со дня получения претензии письменно уведомляет заявителя претензии о результатах рассмотрения претензии.</p>
            <p className="mb-4"> 7.3. При недостижении соглашения спор будет передан на рассмотрение в суд в соответствии с действующим законодательством Российской Федерации.</p>
            <p className="mb-4"> 7.4. К настоящей Политике конфиденциальности и отношениям между Пользователем и Администрацией Сайта применяется действующее законодательство Российской Федерации.</p>
          </section>

          <section className="mb-8">
            <h2 className="heading-3 mb-4">8. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ</h2>
            <p className="mb-4"> 8.1. Администрация Сайта вправе вносить изменения в настоящую Политику конфиденциальности без согласия Пользователя.</p>
            <p className="mb-4"> 8.2. Новая Политика конфиденциальности вступает в силу с момента её размещения на Сайте, если иное не предусмотрено новой редакцией Политики конфиденциальности.</p>
            <p className="mb-4"> 8.3. Все предложения или вопросы по настоящей Политике конфиденциальности следует сообщать на электронную почту PlaybackRental@yandex.ru</p>
            <p className="mb-4"> 8.4. Действующая Политика конфиденциальности размещена на странице по адресу: https://playbackrental.ru/privacy-policy</p>
          </section>



        </div>
      </div>
    </div>
  );
};

export default PrivacyPolicy;
